app/Controllers/Api/StudentApi.php

SELECT *
FROM `students`
WHERE `students`.`deleted_at` IS NULL
---
    public function index()
    {
        $model    = new StudentModel();
        $students = $model->findAll();