app/Controllers/Student.php

SELECT *
FROM `students`
WHERE `students`.`deleted_at` IS NULL
 LIMIT 5, 5
SELECT COUNT(*) AS `numrows`
FROM `students`
WHERE `students`.`deleted_at` IS NULL
---
    public function index(): string
    {
        $perPage = 5;
        $keyword = $this->request->getGet('search') ?? '';

        $query = $this->model;

        if ($keyword !== '') {
            $query = $query->search($keyword);
        }

        $data = [
            'title'    => 'Student List',
            'students' => $query->paginate($perPage, 'students'),

UPDATE `students` SET `deleted_at` = '2026-03-26 12:26:45'
WHERE `id` IN (4)
AND `deleted_at` IS NULL
---
    public function delete(int $id)
    {
        $student = $this->model->find($id);

        if (! $student) {
            throw \CodeIgniter\Exceptions\PageNotFoundException::forPageNotFound(
                "Student with ID $id not found."
            );
        }

        // useSoftDeletes = true, so this sets deleted_at instead of removing the row
        $this->model->delete($id);